
[
  {
    "file": "experiments/veraMolnar.js",
    "name": "Dialog between emotion and method recreation 1.0",
    "description": "This is a recreation of Vera Molnars artwork, Dialog between emotion and method. I choose this because I got inspired by the look of it and the use of color. I used for loops and math.random in this project. The first for loop is used when creating the square layers and the second loop is used in the function draw to create a grid for the squares. I used the math.random when setting the colors to randomnize the color values."
  },
  {
    "file": "experiments/veraMolnarVariation1.js",
    "name": "Dialog between emotion and method recreation 2.0",
    "description": "I continued playing around with the code form the recreation of Vera Molnars artwork. I changed some values to create a different look of it."
  },
  {
    "file": "experiments/veraMolnarVariation2.js",
    "name": "Dialog between emotion and method recreation 3.0",
    "description": "Once again I continued experimenting with the Vera Molnar artwork. I changed from using math.random to using noise instead for the color randomness. I also changed to using HSB instead of RGB."
  },
  {
    "file": "experiments/herbertWFranke.js",
    "name": "Random Square Recreation 1.0",
    "description": "This is a recreation of Herbert W Frankes artwork Random Square. I got inspired by the randomness and the aethetic of the artwork. I used a for loop to create the squares and math.random to randomnize the position and the size of the squares. I also changed the rectMode to center."
  },
  {
    "file": "experiments/herbertWFrankeVariation1.js",
    "name": "Random Square Recreation 2.0",
    "description": "I continued working with the code of the Random Square artwork. I changed so that it randomnized both the width and the height of the squares so that it became rectangles instead. I also added a math.random on the strokeWeight to create more variation, then I added an if statement where the stroke color changed to pink over a certain strokeWeight.  "
  },
  {
    "file": "experiments/herbertWFrankeVariation2.js",
    "name": "Random Square Recreation 3.0",
    "description": "Once again I continued experimenting with the code of the Random Square artwork. In this one I added one more color and I added a fill with a lowered opacity to each color. The color depends on the strokeWeight which I defined in an if statement. "
  },
  {
    "file": "experiments/tylerHobbsBW.js",
    "name": "Flowfield veins",
    "description": "This artwork is inspired by Tyler Hobbs flowfilds artworks. I played around with the values in the Agent class to create an effect I enjoyed."
  },
  {
    "file": "experiments/tylerHobbsColor.js",
    "name": "Flowfield veins with color",
    "description": "In this artwork I reused the same code as in the flowfield vains, however I added colors to make it feel more alive."
  },
  {
    "file": "experiments/tylerHobbsStraight.js",
    "name": "Flowfield experiment",
    "description": "In this code I used the same code as in the earlier two artworks, however I changed values to experiment what would happen."
  },
  {
    "file": "experiments/wave.js",
    "name": "Wavy squares",
    "description": "To make this wave animation I followed a youtube tutorial. I then played around with the values to experiment with the shapes and the movement. "
  },
  {
    "file": "experiments/waveVariation2.js",
    "name": "Laying wave",
    "description": "In this animation I used the same code as for the wavy square. However, I continued playing with the values and also the calculations to see what would happen."
  },
  {
    "file": "experiments/ellipseAgent.js",
    "name": "Ellipse fun",
    "description": "In this animation i continued using the code from the Tyler Hobbs artworks. I changed thing in the Agent class to create ellipses with size changes instead of velocity and force."
  },
  {
    "file": "experiments/waveSoundCopy.js",
    "name": "Sound try",
    "description": ";)"
  }
]
